## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = "s3:PutObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis/download.xlsx"
+                       Sid      = "AllowS3DownloadWrite"
                    },
+                   {
+                       Action   = "sqs:ReceiveMessage"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads"
+                       Sid      = "AllowSQSGet"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-DownloadFFISSpreadsheet-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-DownloadFFISSpreadsheet"
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-DownloadFFISSpreadsheet"
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] will be created
+   resource "aws_lambda_event_source_mapping" "this" {
+       batch_size                         = 1
+       enabled                            = true
+       event_source_arn                   = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads"
+       function_arn                       = (known after apply)
+       function_name                      = (known after apply)
+       id                                 = (known after apply)
+       last_modified                      = (known after apply)
+       last_processing_result             = (known after apply)
+       maximum_batching_window_in_seconds = 20
+       maximum_record_age_in_seconds      = (known after apply)
+       maximum_retry_attempts             = (known after apply)
+       parallelization_factor             = (known after apply)
+       state                              = (known after apply)
+       state_transition_reason            = (known after apply)
+       uuid                               = (known after apply)

+       amazon_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }

+       self_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Downloads FFIS XLSX files and saves to S3"
+       function_name                  = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 30
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
+               "DD_APM_ENABLED"               = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
+               "DD_ENV"                       = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
+               "DD_SERVICE"                   = "grants-ingest"
+               "DD_SITE"                      = "datadoghq.com"
+               "DD_TAGS"                      = "git.commit.sha:b75feb580d41b883c4e8637e445f0ab6229054ea,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
+               "DD_TRACE_ENABLED"             = "true"
+               "DD_VERSION"                   = "b75feb580d41b883c4e8637e445f0ab6229054ea"
+               "LOG_LEVEL"                    = "INFO"
+               "S3_USE_PATH_STYLE"            = "true"
+               "TARGET_BUCKET_NAME"           = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+               "TZ"                           = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = ".amazonaws.com"
+       qualifier           = (known after apply)
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = ".amazonaws.com"
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+           "timestamp" = "1683080553599253000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/0183fbd0b0c73b7dfa70ed2721a16900431a5bfa24d896aef49583c0ff61320f.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-DownloadFFISSpreadsheet",
+                           "cd bin/DownloadFFISSpreadsheet",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-29T02:57:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:25/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip"
      ~ s3_object_version              = "7VPgcUuB6CgrCEGKXRAO8PACm.jUeiZk" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:57408881338ad70a56f4604969885f1aed73464a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:b75feb580d41b883c4e8637e445f0ab6229054ea,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "57408881338ad70a56f4604969885f1aed73464a" -> "b75feb580d41b883c4e8637e445f0ab6229054ea"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "25" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a4e2bdb15b807b147308e77523dec577-2" -> (known after apply)
      ~ id                     = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> (known after apply)
      ~ key                    = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip"
-       tags                   = {} -> null
      ~ version_id             = "7VPgcUuB6CgrCEGKXRAO8PACm.jUeiZk" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1651355488301128883" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip"
          ~ "timestamp" = "1682736994645680000" -> "1683080540056691000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6452751963956111196" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b87338391f0c493bf694658b6d4c5dbea14b6ed02577a84584c8999b00aea168.zip" -> "builds/35b54346f7b070ab3863c0048fe053ce8dd7d6e5885769e4ba35fe21a2feccfe.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-29T02:57:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip"
      ~ s3_object_version              = "nxxpjDjquu2PGTR3vOXpEAoL2lJZZVUh" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:57408881338ad70a56f4604969885f1aed73464a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:b75feb580d41b883c4e8637e445f0ab6229054ea,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "57408881338ad70a56f4604969885f1aed73464a" -> "b75feb580d41b883c4e8637e445f0ab6229054ea"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "158fe4b5dd78f26a742ca44220508569-2" -> (known after apply)
      ~ id                     = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> (known after apply)
      ~ key                    = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip"
-       tags                   = {} -> null
      ~ version_id             = "nxxpjDjquu2PGTR3vOXpEAoL2lJZZVUh" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4146277033406069143" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip"
          ~ "timestamp" = "1682737008861533000" -> "1683080553664219000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6886610542510710100" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/074996cf33de0a129b417b1718c9fa60b9ca79df85f1e31a7d857e7fbe13b14f.zip" -> "builds/b837eb50abbe32e8f571cc35cd06f47c50546333066ce0e686314146fdf328d6.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-29T02:57:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:24" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:24/invocations" -> (known after apply)
      ~ s3_key                         = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip"
      ~ s3_object_version              = "RSz_GN5C8xDPyLg7eA5AiglNec7z93rF" -> (known after apply)
        tags                           = {}
      ~ version                        = "24" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:57408881338ad70a56f4604969885f1aed73464a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:b75feb580d41b883c4e8637e445f0ab6229054ea,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "57408881338ad70a56f4604969885f1aed73464a" -> "b75feb580d41b883c4e8637e445f0ab6229054ea"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "24" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d9dbc67f628cd5b3eed1f207c1d4153f-2" -> (known after apply)
      ~ id                     = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> (known after apply)
      ~ key                    = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip"
-       tags                   = {} -> null
      ~ version_id             = "RSz_GN5C8xDPyLg7eA5AiglNec7z93rF" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "375071124431256148" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip"
          ~ "timestamp" = "1682736994989878800" -> "1683080540063510800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4869708225821441896" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/7e7581819df0723f61dbbfc9180baec818eb10d042b5e25e2bedd151f093b467.zip" -> "builds/16efa19024af8971de1bd071e709a7c55495dbe30ae95392fb1ffa15e040f0b9.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 29 to add, 7 to change, 12 to destroy.

Changes to Outputs:
  ~ lambda_functions = [
        # (1 unchanged element hidden)
        "grants_ingest-staging-SplitGrantsGovXMLDB",
+       "grants_ingest-staging-EnqueueFFISDownload",
+       "grants_ingest-staging-DownloadFFISSpreadsheet",
    ]
```

</details>

*Pusher: @jakekreider, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4867685822)*